/*
 * @Author: Vinton
 * @Date: 2022-06-06 16:53:39
 * @Description: file content
 */
export const gateway = {
  key: ["v%D5%AB%", "F%D8%A2%A6%A6i%A3%", "D%", "8%DA%DE%D0%D", "%D5%", "7je"], // 网关id
  secret: [
    "C8",
    "CB",
    "9B",
    "9A",
    "9B",
    "98",
    "C5",
    "C4",
    "C5",
    "9D",
    "9E",
    "C6",
    "97",
    "99m",
    "96",
    "97",
    "99",
    "9Aj",
    "97",
    "60gijjegkh",
    "91",
    "81",
    "",
  ], // 网关秘钥
};

// 模块内Toast错误码
export const passErrorCode = [
  200, //"参数错误",
  201, //"参数缺失",
  202, //"token 认证失败",
  203, //"访问凭证异常",
  204, //"身份鉴权异常",
  205, //"登录错误",
  206, //"登录密码错误",
  207, //"获取登录信息异常",
  208, //"没有权限",
  209, //"序列化失败",
  210, //"反序列化失败",
  211, //"配置异常",
  212, //"请求异常",
  213, //"返回体异常",
  214, //"数据不存在",
  215, //"数据已存在",
  216, //"数据库链接异常",
  217, //"数据查询异常",
  218, //"数据创建异常",
  219, //"数据更新异常",
  220, //"数据删除异常",
  221, //"数据库事务提交异常",
  222, //"文件下载异常",
  223, //"文件上传异常",
  299, //"未知异常",
  1001, // "反腐层报错",
  1002, // "活动未开启",
  1003, // "活动已开启",
  1004, // "未找到对应的活动",
  1005, // "活动已结束",
  1006, // "活动已存在",
  1011, // "不支持的活动策略类型",
  1012, // "活动策略校验错误",
  1013, // "活动策略不存在",
  1014, // "不支持的活动道具类型",
  1015, // "活动道具校验错误",
  1099, // "数据验证不一致",
  1100, // "活动账户不存在",
  1101, // "不支持的登陆类型",
  1111, // "账户已绑定角色",
  1112, // "账户未绑定角色",
  1113, // "角色已绑定其他帐户",
  1114, // "未找到对应角色",
  1115, // "账户已绑定三方信息",
  1116, // "账户未绑定三方信息",
  1201, // "验证码未找到",
  1202, // "验证码校验失败",
  2101, // "角色信息未找到",
  2102, // "OSS 上传失败",
  30301, // "当前小游戏次数不足"
  1301, //队伍已满员，再看看
  1302, //无法加入多个队伍
  1303, //还未加入任何队伍
  1304, //请输入队伍名称
  1305, //队伍名称已存在
  1306, //组队期已结束，无法操作
  1307, //组队已结束
  1400, //邀请码不存在
  1401, //邀请码已激活
];
// 全局错误码集合
export const errorCode = {};

// 以二次确认弹窗显示的code
export const modalCode = [
  //队伍信息相关报错 13xx
  1308, //抱歉，您不符合条件~只有新玩家和7天未登录玩家可以加入队伍哦~
];
